## Advent of Code: Day 1

In [1]:
import pandas as pd

data = pd.read_csv ('one.txt', header=None)
data

         0
0      151
1      152
2      153
3      158
4      159
...    ...
1995  8075
1996  8078
1997  8081
1998  8112
1999  8127

[2000 rows x 1 columns]

In [2]:
data = data.rename(columns={0:'values'})
data

      values
0        151
1        152
2        153
3        158
4        159
...      ...
1995    8075
1996    8078
1997    8081
1998    8112
1999    8127

[2000 rows x 1 columns]

https://stackoverflow.com/questions/41399538/comparing-previous-row-values-in-pandas-dataframe

In [3]:
data['diff'] = data['values'].diff()

In [4]:
data.head(20)

    values  diff
0      151   NaN
1      152   1.0
2      153   1.0
3      158   5.0
4      159   1.0
5      163   4.0
6      164   1.0
7      162  -2.0
8      161  -1.0
9      167   6.0
10     169   2.0
11     168  -1.0
12     169   1.0
13     170   1.0
14     164  -6.0
15     175  11.0
16     176   1.0
17     178   2.0
18     187   9.0
19     186  -1.0

https://www.geeksforgeeks.org/python-program-to-count-positive-and-negative-numbers-in-a-list/

In [5]:
pos = [num for num in data['diff'] if num >= 1]

In [6]:
pos_count = len(pos)

In [7]:
pos_count

1564

In [8]:
neg = [num for num in data['diff'] if num < 1]

In [9]:
neg_count = len(neg)

In [10]:
neg_count

435

In [11]:
pos_count+neg_count

1999

### Part 2

In [12]:
data['rolling_window'] = data['values'].rolling(3).sum()

In [13]:
data

      values  diff  rolling_window
0        151   NaN             NaN
1        152   1.0             NaN
2        153   1.0           456.0
3        158   5.0           463.0
4        159   1.0           470.0
...      ...   ...             ...
1995    8075  11.0         24195.0
1996    8078   3.0         24217.0
1997    8081   3.0         24234.0
1998    8112  31.0         24271.0
1999    8127  15.0         24320.0

[2000 rows x 3 columns]

In [14]:
data['diff_rolling'] = data['rolling_window'].diff()
data.head(20)

    values  diff  rolling_window  diff_rolling
0      151   NaN             NaN           NaN
1      152   1.0             NaN           NaN
2      153   1.0           456.0           NaN
3      158   5.0           463.0           7.0
4      159   1.0           470.0           7.0
5      163   4.0           480.0          10.0
6      164   1.0           486.0           6.0
7      162  -2.0           489.0           3.0
8      161  -1.0           487.0          -2.0
9      167   6.0           490.0           3.0
10     169   2.0           497.0           7.0
11     168  -1.0           504.0           7.0
12     169   1.0           506.0           2.0
13     170   1.0           507.0           1.0
14     164  -6.0           503.0          -4.0
15     175  11.0           509.0           6.0
16     176   1.0           515.0           6.0
17     178   2.0           529.0          14.0
18     187   9.0           541.0          12.0
19     186  -1.0           551.0          10.0

In [15]:
pos = [num for num in data['diff_rolling'] if num >= 1]

In [16]:
pos_count = len(pos)

In [17]:
pos_count

1611

In [18]:
neg = [num for num in data['diff_rolling'] if num < 1]

In [19]:
neg_count = len(neg)

In [20]:
neg_count

386

In [21]:
pos_count+neg_count

1997